{
    "Blurbs": {
        "Blurb_1": "Hey, nice to have you here. Since you’ve stumbled upon this page, I feel quite obligated to share a little about myself. I am the tour guide of this website. You can call me Dingie and the first stop in the About Me Station is, of course, my hobbies. Storytime!",
        "Blurb_2": "Decisions. Decisions! Decisions?",
        "Blurb_3": "Should I drive onto the yellow brick road or continue on the railroaded track? Dingie ponders to himself while steering the imaginary train to Nowhereland. To our protagonist, the railway offers security, comfort, and familiarity from the many vexing dangerous of the unknown road. However, the existing safety net has made the boy dull in action and stagnant in possibilities. And with a release of air from his impatient lungs, he screams out to the world, jerking the steering wheel onto the dusty path.",
        "Blurb_4": "Along the trail, a myriad of encounters presents itself in front of our champion. To resolve each challenge, the boy combines a dash of creativity with a blend of past experiences. And he pulls from himself, a sword of action to cut through the swath of conflict. Resolution after resolution, bad and good, our character eventually reaches the end of his journey. With his head turned back behind him, he smiles at the long winding road and wonders how he even reached this point.",
        "Blurb_5": "And of course, with every journey, there is a treasure for our hero. Dingie leaps from the tall train and plunges himself in front of the chest. Opening the chest, he finds inside a dingy doll, a pair of weights, a chisel, and a wrinkled map. The items are not the typical kind of goods for an adventurer, but still a find with innumerable value.",
        "Blurb_6": "Picking up the dingy doll, Dingie scrubs it with his hand but to no avail. The toy, permanently blemished by the constraints of grandfather time. With a sign, he slips the object into his tool belt and picks up the pair of weights. One weight in each hand, the boy assesses the uneven set with a furrowing brow. He picks up the chisel from the ground and begins to shape the malleable metal. After a considerable amount of time, he beats the extra pieces off of his pants and lets it fall upon the ground. He holds the weights once more in each hand and a serene sensation wells within him. Perfectly balanced, as all things should be. Putting them aside, Dingie grabs the scroll. On its pages, a yellow meandering route coupled alongside faint railroad lines. He traces his finger across the path he had just taken. At the end of the line, a little footnote glistens before his eyes. Wrong-way, please try again.",
        "Blurb_7": "End."
    },
    "Goals": {
        "Goal_1": "Prepare Portfolio for College Admission",
        "Goal_2": "Run a Marathon/Obtain Optimal Running Weight",
        "Goal_3": "Prepare the outline for my book on Decision-Making",
        "Goal_4": "Reach/Stay in Grandmaster tier in League of Legends for Season 10"
    },
    "Goal_Answer": {
        "Goal_1_Answer": {
            "1": "Section 1 (10/22/19): Planning, Review, and Setup (Completed)",
            "2": "Section 2 (11/16/19): Improve on Website features and re-design layout",
            "3": "Section 3 (12/11/20): Research/Practice what it takes to be a successful Phd Candidate",
            "4": "Section 4 (01/05/19): Dropping Fruit Game with Experience Replay and Deep Q-Learning (Turn based)",
            "5": "Section 5 (01/30/20): RL with Convolutional Neural Network",
            "6": "Section 6 (02/25/20): RL with Asynchronous Advantage Actor-Critic A3C",
            "7": "Section 7 (03/21/20): RL with Recurrent Neural Network (TBD)/Long-Short Term Memory Neural Network",
            "8": "Section 8 (04/15/20): Dive into Genetic Algorithm",
            "9": "Section 9 (05/10/20): RL with TensorFlow/PyTorch/OpenAI(TBD)",
            "10": "Section 10 (06/04/20): RL in Robotics",
            "11": "Section 11 (06/29/20): RL with Gameboy Emulators",
            "12": "Section 12 (07/24/20): Social RL",
            "13": "Section 13 (08/18/20): RL with Unreal Engine",
            "14": "Section 14 (09/12/20): Fixing Site and Submitting Graduate School Applications",
            "15": "Section 15 (10/07/20): Fixing Site and Submitting Graduate School Applications"
        },
        "Goal_2_Answer": {
            "1": "11/30/2019: Current Run: 5 km, Current Weight: 163 lb",
            "2": "12/31/2019: Run Goal: 10 km, Weight Goal: 157 lb",
            "3": "01/31/2020: Run Goal: 15 km, Weight Goal: 152 lb",
            "4": "02/29/2020: Run Goal: 20 km, Weight Goal: 147 lb",
            "5": "03/01/2020: Race Sign Up Day",
            "6": "03/31/2020: Run Goal: 30 km, Weight Goal: 142 lb",
            "7": "04/30/2020: Run Goal: 35 km, Weight Goal: 137 lb",
            "8": "05/23/2020: Race Day"
        },
        "Goal_3_Answer": {
            "1": "Research how to become a better writer",
            "2": "List out the core concepts for the book",
            "3": "Write a synopsis of each concept in the book",
            "4": "Research each individual topic",
            "5": "Create a chapter template detailing the location/flow of each chapter",
            "6": "Study fallacies and errors in human judgement",
            "7": "Complete 1 chapter (rough draft)"
            
        },
        "Goal_4_Answer": {
            "1": "Consistently hit Diamond 1 across multiple accounts",
            "2": "Reach Diamond 1 50 league points",
            "3": "Reach Master Promos (Diamond 1 100 league points)",
            "4": "Reach Masters",
            "5": "Consistently be able to stay in Masters",
            "6": "Reach halfway between Masters and Grandmasters",
            "7": "Reach Grandmasters",
            "8": "Consistently be able to stay in Grandmasters"
        }
    }
}